# =====================================
# Brewfile - Homebrew packages
# =====================================

tap "homebrew/bundle"
tap "homebrew/services"

# CLI tools
brew "bat"                  # Cat with syntax highlighting
brew "btop"                 # Resource monitor
brew "fzf"                  # Fuzzy finder
brew "gh"                   # GitHub CLI
brew "git"                  # Version control
brew "gnupg"                # GPG encryption
brew "httpie"               # HTTP client
brew "jq"                   # JSON processor (for statusline)
brew "just"                 # Command runner (Makefile alternative)
brew "lazygit"              # Git TUI
brew "mitmproxy"            # HTTP proxy tool
brew "navi"                 # Interactive cheatsheet
brew "node"                 # Node.js
brew "pinentry"             # GPG pin entry
brew "pipx"                 # Python app installer
brew "shellcheck"           # Shell script linter
brew "tmux"                 # Terminal multiplexer
brew "wget"                 # File downloader

# Dev tools
cask "docker"               # Container platform
cask "visual-studio-code"   # Code editor

# Productivity
cask "discord"              # Chat app
cask "notion"               # Note-taking
cask "slack"                # Team communication

# Utilities
cask "alt-tab"              # Window switcher
cask "chatgpt"              # AI assistant
cask "claude-code"          # Claude Code CLI
cask "ghostty"              # Terminal emulator

# Fonts
cask "font-d2coding"        # D2Coding font
