# =====================================
# Brewfile - Homebrew packages
# =====================================

tap "derailed/k9s"
tap "manaflow-ai/cmux"

# CLI tools
brew "bat"                  # Cat with syntax highlighting
brew "eza"                  # Modern ls replacement
brew "btop"                 # Resource monitor
brew "blueutil"             # Bluetooth CLI
brew "cowsay"               # ASCII art message generator
brew "claude-squad"         # Multi-agent session manager
brew "direnv"               # Per-directory environment loader
brew "exiftool"             # Media metadata tool
brew "ffmpeg"               # Media converter
brew "fortune"              # Random quotes
brew "fzf"                  # Fuzzy finder
brew "git-delta"            # Git diff viewer (used by git config)
brew "gh"                   # GitHub CLI
brew "git"                  # Version control
brew "git-lfs"              # Git large file storage
brew "gnupg"                # GPG encryption
brew "httpie"               # HTTP client
brew "hurl"                 # HTTP request runner
brew "jq"                   # JSON processor (for statusline)
brew "just"                 # Command runner (Makefile alternative)
brew "lazydocker"           # Docker TUI
brew "lazygit"              # Git TUI
brew "gemini-cli"           # Google Gemini CLI
brew "glances"              # System monitoring tool
brew "navi"                 # Interactive cheatsheet
brew "node"                 # Node.js
brew "pcp"                  # System performance toolkit
brew "pinentry"             # GPG pin entry (terminal)
brew "pinentry-mac"         # GPG pin entry (macOS GUI/IDE)
brew "pipx"                 # Python app installer
brew "ripgrep"              # Fast recursive search
brew "shellcheck"           # Shell script linter
brew "stow"                 # Symlink farm manager
brew "tmux"                 # Terminal multiplexer
brew "vegeta"               # HTTP load testing
brew "vim"                  # Vim text editor
brew "wget"                 # File downloader
brew "wimlib"               # Windows imaging (WIM) tool

# AWS & Cloud
brew "awscli"               # AWS CLI
brew "gimme-aws-creds"      # AWS credentials helper

# Kubernetes
brew "kubectx"              # Kubernetes context/namespace switcher
brew "derailed/k9s/k9s"     # Kubernetes TUI

# Python
brew "pipenv"               # Python virtualenv management
brew "pyenv"                # Python version manager

# Database
brew "libpq"                # PostgreSQL client library
brew "mysql"                # MySQL database

# Libraries
brew "expat"                # XML parser library
brew "librsvg"              # SVG rendering library
brew "pkgconf"              # pkg-config (pyenv dep)

# Dev tools
brew "docker-compose"       # Docker Compose
brew "dive"                 # Docker image layer explorer
brew "go"                   # Go programming language
brew "golangci-lint"        # Go linter
brew "gopls"                # Go language server
brew "mac-cleanup-go"       # macOS cleanup utility
cask "cmux"                 # Terminal multiplexer for coding agents
cask "cursor"               # AI code editor
cask "cursor-cli"           # Cursor CLI
cask "docker-desktop"       # Container platform
cask "figma"                # Design tool
cask "github"               # GitHub Desktop
cask "httpie-desktop"       # HTTPie desktop app
cask "mitmproxy"            # HTTP proxy tool
cask "ngrok"                # Secure tunneling
cask "visual-studio-code"   # Code editor

# Productivity
cask "discord"              # Chat app
cask "notion"               # Note-taking
cask "notion-calendar"      # Calendar by Notion
cask "notion-mail"          # Email by Notion
cask "slack"                # Team communication

# Utilities
cask "alt-tab"              # Window switcher
cask "chatgpt"              # AI assistant
cask "claude"               # Claude desktop app
cask "codex"                # OpenAI Codex CLI
cask "ghostty"              # Terminal emulator
cask "iina"                 # Video player
cask "rectangle"            # Window manager
cask "spotify"              # Music streaming

# Fonts
cask "font-d2coding"        # D2Coding font

# uv (Python tools)
uv "specify-cli"            # Spec-driven development CLI
uv "sqlit-tui"             # SQLite TUI

# npm (global packages)
npm "@ast-grep/napi"        # Structural code search
npm "oh-my-claude-sisyphus" # Claude tooling
npm "pnpm"                  # Fast package manager
