# =====================================
# Brewfile - Homebrew packages
# =====================================

tap "2ykwang/2ykwang"
tap "anomalyco/tap"
tap "derailed/k9s"

# CLI tools
brew "bat"                  # Cat with syntax highlighting
brew "btop"                 # Resource monitor
brew "cowsay"               # ASCII art message generator
brew "fortune"              # Random quotes
brew "fzf"                  # Fuzzy finder
brew "git-delta"            # Git diff viewer (used by git config)
brew "gh"                   # GitHub CLI
brew "git"                  # Version control
brew "gnupg"                # GPG encryption
brew "httpie"               # HTTP client
brew "jq"                   # JSON processor (for statusline)
brew "just"                 # Command runner (Makefile alternative)
brew "lazygit"              # Git TUI
brew "gemini-cli"           # Google Gemini CLI
brew "glances"              # System monitoring tool
brew "navi"                 # Interactive cheatsheet
brew "node"                 # Node.js
brew "pinentry"             # GPG pin entry (terminal)
brew "pinentry-mac"         # GPG pin entry (macOS GUI/IDE)
brew "pipx"                 # Python app installer
brew "shellcheck"           # Shell script linter
brew "tmux"                 # Terminal multiplexer
brew "wget"                 # File downloader

# AWS & Cloud
brew "awscli"               # AWS CLI
brew "gimme-aws-creds"      # AWS credentials helper

# Kubernetes
brew "kubectx"              # Kubernetes context/namespace switcher
brew "derailed/k9s/k9s"     # Kubernetes TUI

# Python
brew "pipenv"               # Python virtualenv management
brew "pyenv"                # Python version manager

# Database
brew "libpq"                # PostgreSQL client library
brew "mysql"                # MySQL database

# Dev tools
brew "docker-compose"       # Docker Compose
brew "go"                   # Go programming language
brew "golangci-lint"        # Go linter
brew "gopls"                # Go language server
brew "2ykwang/2ykwang/mac-cleanup-go"  # macOS cleanup utility
cask "cursor"               # AI code editor
cask "docker-desktop"       # Container platform
cask "figma"                # Design tool
cask "httpie-desktop"       # HTTPie desktop app
cask "mitmproxy"            # HTTP proxy tool
cask "visual-studio-code"   # Code editor

# Productivity
cask "discord"              # Chat app
cask "notion"               # Note-taking
cask "slack"                # Team communication

# Utilities
cask "alt-tab"              # Window switcher
cask "chatgpt"              # AI assistant
cask "claude"               # Claude desktop app
cask "claude-code"          # Claude Code CLI
cask "codex"                # OpenAI Codex CLI
cask "ghostty"              # Terminal emulator
cask "rectangle"            # Window manager

# Fonts
cask "font-d2coding"        # D2Coding font
